# RebarShapeMultiplanarDefinition Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeMultiplanarDefinition Constructor
RebarShapeMultiplanarDefinition Class See Also
---
Create a RebarShapeMultiplanarDefinition for use in creating a RebarShape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RebarShapeMultiplanarDefinition(
	double outOfPlaneBendDiameter
)
```

Visual Basic
---
```text
Public Sub New ( _
	outOfPlaneBendDiameter As Double _
)
```

Visual C++
---
```text
public:
RebarShapeMultiplanarDefinition(
	double outOfPlaneBendDiameter
)
```

# ### Parameters
outOfPlaneBendDiameter
    Type: System..::..Double Bend diameter to be used when the rebar bends out of its main plane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for outOfPlaneBendDiameter must be greater than 0 and no more than 30000 feet. |

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace